import { useEffect, useRef, useState } from "preact/hooks"
import { useDocumentTitle } from "@hooks"
import { getObservation } from "./core"
import { Button } from "@components"
import { PATHS } from "@types"
import * as S from "./styles"
import { Boo } from "./boo"

export const NotFound = () => {
    const [time, setTime] = useState(30)

    useDocumentTitle(time != -2 ? "404" : "T̛̠̹̭̹̄ͬͫ͐̿ͩͪ̊̈́͆ĥ̷̡̹͙̬̠̼͙ͧ̋ͪ̎̿ͦͦ̿̕i͔̣̱s̜̻̻̱ͬ͋͋_̆̐̈͠ ma͓̅̑̕ͅ_̧̛͙̪̟̲̆̋̇̈́ͪͬ̉͜͢ś̸̺̔̅̕s̵̷̸̨̪̮̫̺̤̩̝ͭ̃͑̽ͣ̔̀̈̀̄͗ͣͤ̓̆ͫ̎͢͢͢͜͞ h͇y̨̖̣̦̆́͑ͪͬ͡_̨̛̳̺͔͉͎̫̞ͣ̓̉̆ͧ̈̍̕͘͘͟͞͡ͅ_͊s͕̭ͮ_̶̡̛̛̹̠̠̙͉͖̗ͭ͋̍ͥ̾̍̾͊ͩͣ̽́ͧ̌̕͢͜ͅͅt̢̨̥̘̮̂̋͋ͤ͝͠ͅe̖͆r̡̛̗͇̈͌ͥiã̴̧̛̳͔͍̖͚͉͙ͫͫ̃̓̅ͦͣͫ͊́͢ͅ_͒ w̱̻̰͉̬̩̘̓͊͆̍͡a̷̸̧̨̛̲̱̬̟̦̦͈̗͍̩̜͔̪̞͎̜̝͉͌ͣͨ̄ͥ͗ͥ̀ͮ̆̐̆ͧ̀ͬ̚̕͟͡͠͞͡s̻̘̦̺ͨ̈́͆̇̊̊ͮ́̈́ͯ̕͢_̴̷̶͓͉̲̘̗̪̫̜͈̀̀͆ͧ͂̌́̒̄͐ͨ͘͢ c̭̯͊͑͡ḁ̹̖͖ͬ̒́ͮ̂͊ͤ̄́̌ͫ͋̋̏ͮ̓̎ư̸̶̵̷̶̴̶̢͉͈̬̤͓̦̭̻͒͛̾ͤͩ͌ͪ͛̓͗́ͫ̾ͫ͝ͅs͍̰͎̲̦͓̝̹͍̘ͧ̍̀͑ͪ̆͌͘͢͝ͅė̢̙̹̱̱̞̗̜̥͇̯̬̹͉͍͕̮̗̏́ͯ̑͒̋̔̿̈́̀ͣ́́ͤ̿̀̀ͧ͘̚͘͟͢͢͞͞d̸̸͔̣̥̩̦̖̝͓͓̘͖̬̩̮̭̏̐̓̅ͬ̃̾ͥ̀̇̔̽̌ͨͦ̌͂͐͗̑͢͟ b̡͚̖͕̥̘͍̭̌̀͂ͦ̀̈́̓̍̓̔̆ͥ̀̽̂ͦ͢y̴̵̢̧̛̙͔̞̣̩͚̫̯̗̪̹̘̼̹̙͖͗̑͆ͧ͐̉̋ͯ͑ͣ͑ͨ͒̂̎ͯ̿ͭͤ̃ͩ͗͘ͅ t̵̠̗͔̆̒͠͠ḩ̶̷͈͙̟͍͙̜ͭ͛͐̔͒̿̆̾́̄̾͆͢͝ͅe̶̛̱̜͈̖̳͖̘͔̟̖̒͐̇̊̏͞ f̢͕͖ͦ_̧̛̜̻͇̖̩̰̻͔̹̤̦ͥͩ͛̂͌ͤͫ͐̋͆͜͜_̮̲͙̭̝̓ͪ́̓̽i̎̚r̷̶̶̷̵̶̡̬̞͚͎̦̖͕͉̱͓͚̭̝̳̮̅ͥͯͨ̃ͧ̈ͪ̒̋̀̍̽͒̆̈ͮ͢͞͠͡_s̵̢͙̼̼̩̣̲̟̍̿́̈́͊̐̑ͧͤ̎ͮ̚͘͜͜͢t̩̠́̔̇̏́̽͡͠ ȑ̷̛̘͕̱̩̠͚̣ͦͤͪ̃͢͜_̲ͥ͑_̵̡̢̣̟̗̭͑̀̔̈́̕è̷̢̡̡̢̻̺̜ͥ͐͗̏̈́̆͆ͦ̉̉̔̃̐̚̕͘͟͜͜͝l̛̹̝̖̘̂ͥ̔ͦ͗ͧ͠e̸̘̤̮̟̦̠̙͙̩̠̩͖̦̓ͮͥͣ̏̽̌̌̎̈́̎̌̎͟͠͡â̸̵̴̶̠̖̪͍͇͍̝ͦ̑́́̄̍͘_̆ͩͫ̚s̷̸̶̛̛͕͖̱͚̘̤͖̯̗̹͎͍̳̰̝̋̾ͬͨ̌̑̃ͮͤͨ͛̀̆̚͢ͅȩ̴̴̧̡̫̘̹̫̖͔͍̥̰̖ͭͯͩ͑ͥͦ̃͗ͮ̐̆͂̈̐̀͗̚͢_͎͂̅ͦ͑d̵̶̸̛̛̥͙̲͚͉̙̺̳̩̦̣͈̳͒̅̍̊̃ͣ̍̅̽̍̉͜͞͝ ṿ̵̧̨̼̜͇̦̞̼̭̗̰̻̠̲͈̓̆̅̀͐̀̿̓̅̀ͣ̒́̽̄̓͟e̶͖̤̠̰̅͒̆͢ŗ̵̡̰̳͖̦̫ͥ̓ͨ̄ͨ͛̄̏ͪ̉̂̆͋̂̍͂ͫ͠_̹͈̜̬͖ͨ͗̑̎̂̑͟͞ş̴̵̵̛̟̻͔͈͎̞̟̟̹̮̰̪͓̎ͬ̓́̔̀ͮͫͤ̆̾̉̑͗̈͒̃͐̚̚͜͜͞͝͠ḭͭ_̶̛͖̱̰͓͇̗͚̙͔̃̊ͬͧ͋ͬ́ͮ͘̚̕͠ͅo̷̵̢̗̠͍̼̻̻͙̰̞͓̣̭̦͚̖̭̤ͪͤ̍ͭͬͨͤ̌͐̈́̔̄ͧ̅́͂͌̐͛̕͘̕͜͞͡n̷̴̸̨̬̝͔̤͓̬̭̫̻̙̤̲̿̊̒̀̀͗̿ͭ̊̈́͑͆̂͌̓͊̿̐̈́͆̚ͅ o̡͓͙̞̩̓ͬ̋͗͠f̞̔̓ ť͉̣̱͎̮͉̪̳̖ͤ̂̋ͨ̚͘͜h̵̷̨̭̩̹̖̤͓̗̻͕̮͖͎͂̏͆̅ͧ͒̋̍ͣ͛̌͆̓̈̊ͤ̏͢͠͡͞é̸̛͖͎͔̪̞̠̞̙̜͔͈̩̆̐̀ͦͧͦ̏̂͐͆̊͌̓̑̕͟͡͞ g̸̡̠ͯą̷̛̛̞̰͓̯̣̱͇̯̝ͩ͆͗̎̈́ͨͨ̀͐̐ͅm̶̵̹͍̩̝̯̼͍͙̺͙͔͋ͪͦ̍͛̑̏̅ͪ̿̒̈ͤ̔̂̕͡ͅḙ̴̸̢̠͔̾̈́ͥ̑͂͘̕.̣̞͖̟͊̈́ͤ_̵̶̮͕͕̦̮̫̱͉͓͓̫̙̪̣͗ͭ̀̊ͫ̐̊ͯ͒̐͋͆̃̐̿͂́̾̕͡ͅͅ A̡̺̱͓͚̮͚̰̖̤̫͔̯̫͔͎͖̺̎ͭͥ̃͆ͦ̍ͧͫ͐̃̀ͯ̎ͩ͘̕͜͠ͅf̴̸̡̦̭̬͓̗̼̤͉͕͌͗̎͒́͌̊͛͢͜t̸̨͓̺̼̿̿̐é̞̪ͧ͒ͯ̽͛̈ͅr̗͓̕_̶̴̧̙̗̮̰̯̺̙̥̎ͩ͌͗̔̅ͭͥͨ͑͐͜͟͟ͅ_̥͈ͥ͐̀̂ͣͮ ť̸̴͎̖͔ͬͬ̐͗̈̓̍̇͘͘͘͟͠h̶̵̢̻͙̪̤̰͎̻̲̙͎̤̺̓̈ͪ́̿ͮ̒ͨ̌͋ͮ̀̎͘͢ê̡̢̛̻̯͖̼̣̮̐̆̌͗̓̓̀͜͡ i̛̲̹͐͜͠_̴̵̸̶̸̢̧̨̧̛͍̜̮͔̩̻̼̝̖ͧ̈́ͭͫ̃̈́ͥ̆ͤ̏̍̓͛̔̕͢͠͝ͅn̡͍͓͓̙͎̤̠̯͛̾ͫ̍ͯ͟͜͠_̞̭̫̉͆̀c̵̸̴̵̶̡̲͙͈̬̘̞̣̹̭̟͂̿̈ͯ́͐͐̔ͦ̈͊͆̿ͬͮ̕_̺̩̰̳̒̉̽ͩ͐͜͝i͔̇̚ďe̡̢̠̯̠̲̗͖͙̣̗̤̠̘̹̥̦̲̲̱̯̣̝ͦ͆̄ͤ͑͌̓̊ͫ̅ͨͩ̏̊͌̈́ͯ́̇̒͘͟͝͡ǹ̄ṭ̡̨̛͇̗̥̭̟̟̭͈̺̫̦̦̓̉ͥ́͑͆ͨ͌̏̀ͮ̉̊ͦ̏̓̊͌͘͘͘͟͟͞͠͡ͅs̙̠̲ͭ̆́ͤ͒͗͜_̢̆ͤ_̵̷̛͈̯̤̳͖̙͇̖̑ͮ͂̇͐̄͌͊͋ͭ͆͜,̢̨͕̯ͥͫ͡ ṯ̡͎̫ͪ̒ͪ̌h̷̡̳̦͎̗̍ͦ̈́̏ͨͤ́ͦ͟͝e̩ͮ͗͟͠ p̸̵̵̢̟͇͎͈̯͍̝̳̗̥̀̀̾̉̂̈́̋ͥ̑̐̒ͪ̽͌ͥͥͭ̆̐̽͋̕r͍̤̯̥͇̩̮̗͍̙̘̪ͨ́̉͐͂̃̅̓̃̀̓̌̓͟͞͞ͅo̸̷̢̢̡͎̬̥̩̪̲̪̮̠͇̯͆̽̂̍̋̂͆̀ͧ̿́̐̆͆ͫ̍ͨ̽ͩ͢͝g̶̢͙͍͓̰̠̼̭͈͔̍ͣ́ͭͅr̸̷͉̬̺̟̤͓̂ͨ́̐̈́ͪ̅͢_̨͕̘̮͙̥̮̯̰̝̬̺́ͦ̋͌̈͆͗̽ͪ͒̈́͂͛̕͜͢͢a͕̖̅͌̾̔m̷̶̭̼͈̕͟m̵̠̿ͮ̊͂ͮę̷̴̡̭̞̯̯̞̬̯̝͔̃͂ͯ͘̚͢͞_̴ͬ̊̃̎ͮ͊̄̕͘r̳̔̐͡s̛͓̞̺ͭ͂̐ͭ f̺i̸̛̗̗̲̣̤̫̜̥̘͉̎ͮ́̅̒͑̂̐ͩ̽̓ͫ͐̆͘̕̚͢ẍ̢̠̺͉̲͍̤̯̹̥́͌ͧͥ͒͛ͭͩ̉ͣ̒̅͑́ͫ̃͢e̶̶͇͙̣̯̤̙͙͙͉̘̭̖̣̮̮̖ͣ͒̔̐͑ͦ̽̎ͫͦͬͪ̒͆ͩ͗̇́̃̚͜͢͢͞͝͡d̴̢̧̝͈̳̖̜̎͆ͦ̀̓̆͟ͅ t̞͙̕h̵̘͓͍̬̰̙̦̾ͨ͘̚_̦ͬ̂̓̾́ͧe͇̦̺̒ͫ̊ l̷̡̨̨̺͍̙͕̦͈͎͓̹̘̲͙̾̋͗͊̑ͩ͛̇̿̿͂ͦ̂̍̾̾ͦ̓̇̾̃͘͜͟͠o̴̢̤̗̪̮̣̫̱̰͎͙̝͈ͤ͒ͤ͂̉͒̆͗̌̂ͧ͐ͧ̐̆̒c̴̛̠̘̲̦̺̫̰̯̝͔̤͎̝̻͚͍͍̼͚ͥ͛ͫͣ̑ͥ́̀͑͌́͒̆͘͜a̵̛̮̗͓̒̑͘_̢̡̜̦̩͙͔̹̠̘̑̈͑ͮ͑ͪ̐̇ͥ͊̓ͤ͛̏ͬ͘͠͞͝t̵̴̸̖̮͉̲̜̅̈ͪ͂̋̿̓̇̀͌ͬ͂̎͘͜ͅi̶̸̴̷̢̼̱̣͙̩̜̬̖̦̭͕͚̱͚͎̘̺̻͒̓̈̉͒̋̓͛͆ͮ̐́͑̑̄̓̊ͧ͟͠͝͞͝oṅ̴̴̝̞͔̖̲͔̫͍̻̼̻̠̻̂͑́͒͂̿̌͐ͧͧͭ̾ͥ̚͢͠ͅ'̡͖̻̘̬̤̖͙̅̏ͪ̌̇͡ͅ_̶̦̹͈̖͔̦̱̅ͤ͐ͧ̿̾ͨ͛̉̚͡s̸̳̰͕̫̞̞͍̳͕̜̖ͥ͊̉͑͆ͧ̋͑̒̿͑͑͒͆͑͋̿ͥͬ̍ͤ̅ͮ̕͞ m̤̮̼̝̥ͥ̈́́ͣͬu͂͛͊́ͫ͌́s̴̺̠̤ͣi̵̹͕̬̙͐͑͗̈́ͮ̒̒͒͜c̷̸̷͚̱̙̳̮͇̝͚͉̩̩̼̖̺̼̟͕̘̲͙ͩ̎ͮ͑ͥ͒ͭ͛̂͋ͯ͊̿͐͆̔ͣ̀͐̚͟͠͞͝ ṭ̡͉̠̠ͭ̋̊o̢̻͚̬͗̏̚͠_̸̡̠̙̥̦͕͇̻̮͋̐ͫ͋̽́̌̿̌̋̓ͪ͢ b̛̤̤̣̬̾̍̕e̛̬̟̮͉ͭ̍̓ͪ͋͑̾ͮ͟_̞̥̘̱̬̞̮̋̄̆ͮͨ̍ͥ̇͛̽͜_̡ ą̴̶̨̲̠̩̗̤̥̲̼͚̞̮̠̖̥̰̯̓ͩ̿̆ͭ̈́ͥ́̀ͤ̚͝ͅṱ̴̷̸̫̹͍̟͒̎̒̎̈́̀ͤ̀ͦͬ̔͛́̕̕͠ à̢͍̜͚̟ͫ͆́͒͘͠ l̝̘̜̱̅ͥ̋̃͘ỏ̶̡̱̬̼̩̮̘ͨ̋̑̆́̅̈́ͩ͘͠͞ͅw̵̷̧̢̧̡̡̞̻̬̺̳̤͇̹͎ͣ͊ͣ͗̇͊ͯ͂̔̆ͨ͆ͪ̒̄̓͋͢͡ͅe̩̲̮̪͇͉̒͗ͬ̏͗̏͆̍̍ͨ̀ͤ͒̕͜͡͞r̺̖̩̾ͦ̑ͩͩ́͛ f̷̶̧̰̹̦͙̠̪͈̟̰͚̦̙͍͎̱̼̦̉̃ͣ̈̄̈̾͌͒̃ͫ͒ͥ͑̿ͧ͊̓̌͘͝_r̵̶̸̢̼̫͚͔̥̫̤̣̞̻̟̦͕̂̅̉̓ͨͦ͆̓ͮ̀̐ͨ͘͜͞ḛ̸̸̵̛̗̰͕̲̻̥͎̪͇̻̊͋̂͒̽͂͛͋͗̋͂q̵̵̥͖̩̲͈̼̱̗̠̖̖̝͍̟͉̈͊ͭ̑̉̈́̍̆̀́̌ͨ̾́ͤ̇͌͋̇͋̕̕͘͡͞ứ̶̡̧͔̟̺̲̜̻̲̹͉͕̰̳͉̞͌̍̈́̾ͥ͗́̑ͩ̀̇͊͂ͫ̈́̈́͌̆͘̚̕͢͜͝͠ͅe̢̡̘̘͖̪͉̭͍͎͉͇̰̦̼̦̅ͪ̊ͭ̂̃ͬͭ̓͛ͤͤͭ̐ͤͫ̿̂ͮ̍̚͜͜͡͡n̡͉͎͍͔̪̹̼̱̮̈́ͫ̏̋͆͛́͂ͦ̍͋ͯc̴ͫ_̦̜ͫ̉͌͌y_̛͎̟̮͖̩̪͉ͪͫ̒͐̐́ͧ̉̃ͯ́̈́̌̔ͫ̅̓͞_̵̧͍̰͚̙̭͌̔̑ͮ͐͛͆̆͞")

    const booSoundRef = useRef<HTMLAudioElement>(null)
    const musicRef = useRef<HTMLAudioElement>(null)

    const decreaseTime = (time: number) => {
        if(time === -1) return
        setTimeout(() => {
            setTime(time - 1)
            decreaseTime(time - 1)
        }, 1000)
    }

    const handleYes = () => {
        document.body.style.pointerEvents = "none"

        if(!booSoundRef.current) return
        booSoundRef.current.volume = 0
        booSoundRef.current.play()

        setTimeout(() => {
            if(!booSoundRef.current) return
            booSoundRef.current.currentTime = 0
            booSoundRef.current.volume = 1
            booSoundRef.current.play()
            setTimeout(() => {
                setTime(-2)
            }, 100)
            setTimeout(() => {
                musicRef.current?.play()
                document.documentElement.requestFullscreen()
            }, 3000)
        }, 1000)
    }

    const handleNo = () => {
        setTime(30)
        decreaseTime(30)
    }

    useEffect(() => {
        decreaseTime(time)

        return () => {
            musicRef.current?.pause()
        }
    }, [])

    return (
        <S.Screen>
            {time >= 0 &&
                <S.Card>
                    <S.Title>This route doesn't exists</S.Title>
                    <S.WarningText>You have</S.WarningText>
                    <S.Time>{time}s</S.Time>
                    <S.WarningText>to
                        <Button
                            children="return"
                            navigate={{path: PATHS.HOME}}
                        />
                    </S.WarningText>
                    <S.ObservationText>
                        {getObservation(time)}
                    </S.ObservationText>
                </S.Card>
            }
            {time < 0 &&
                <S.Card>
                    <S.Title>Did you read the last warning?</S.Title>
                    <S.Buttons>
                        <Button
                            children="Yes"
                            onClick={handleYes}
                        />
                        <Button
                            children="No"
                            onClick={handleNo}
                        />
                    </S.Buttons>
                </S.Card>
            }
            {time === -2 && <Boo />}
            <S.Audio
                ref={booSoundRef}
                src={"/audio/boo.mp3"}
                preload="auto"
            />
            <S.Audio
                ref={musicRef}
                src={"/audio/music.mp3"}
                preload="auto"
                loop
            />
            <S.PreloadGhost
                src={"/img/ghost.webp"}
                preload="auto"
            />
        </S.Screen>
    )
}
